In [1]:
import pandas as pd
import numpy as np

In [2]:
my_series = pd.Series([1, 2, 3, 'string', 4.3, -34])
my_series

0         1
1         2
2         3
3    string
4       4.3
5       -34
dtype: object

In [3]:
my_series = pd.Series([1, 2, 3, 'string', 4.3, -34], index=['a', 'b', 'c','d', 'e' , 'f'])
my_series

a         1
b         2
c         3
d    string
e       4.3
f       -34
dtype: object

In [4]:
my_series['a']

1

In [5]:
my_series = pd.Series({'London':10, 'Tripoli': 100, 'Cairo': 10})
my_series

Cairo       10
London      10
Tripoli    100
dtype: int64

In [6]:
my_series['London']

10

In [7]:
my_series[my_series > 10]

Tripoli    100
dtype: int64

In [9]:
arr = np.array([[1, 2, 3], [4, 5, 6]])
df = pd.DataFrame(arr)
df

   0  1  2
0  1  2  3
1  4  5  6

In [10]:
df[2]

0    3
1    6
Name: 2, dtype: int32

In [12]:
arr = np.array([[1, 2, 3], [4, 5, 6]])
df = pd.DataFrame(arr, columns=['col 1', 'col 2', 'col 3'])
df

   col 1  col 2  col 3
0      1      2      3
1      4      5      6

In [13]:
#df.loc - labels
#df.iloc - integer/location
df.iloc[0,0]

1

In [17]:
df.iloc[1:3]

   col 1  col 2  col 3
1      4      5      6

In [16]:
df.iloc[:,1]

0    2
1    5
Name: col 2, dtype: int32

In [18]:
my_series.to_frame()

           0
Cairo     10
London    10
Tripoli  100

In [19]:
my_df = pd.DataFrame(np.random.randn(25).reshape((5, 5)), index=['a', 'b', 'c', 'd','e'], columns=['c1', 'c2', 'c3', 'c4', 'c5'])
my_df

         c1        c2        c3        c4        c5
a  0.222896 -0.607435  0.344710  0.005194  0.188135
b  0.786749 -2.182182  0.500794  1.046098  1.692836
c -2.162436  2.044867  0.115989  1.225235  0.284912
d -0.749077  0.455451 -0.586023  1.805931  1.159662
e -1.662098 -0.086013  2.302941 -0.553762  0.200082

In [20]:
my_df.drop('b')

         c1        c2        c3        c4        c5
a  0.222896 -0.607435  0.344710  0.005194  0.188135
c -2.162436  2.044867  0.115989  1.225235  0.284912
d -0.749077  0.455451 -0.586023  1.805931  1.159662
e -1.662098 -0.086013  2.302941 -0.553762  0.200082

In [22]:
my_df.drop('c2', axis=1)

         c1        c3        c4        c5
a  0.222896  0.344710  0.005194  0.188135
b  0.786749  0.500794  1.046098  1.692836
c -2.162436  0.115989  1.225235  0.284912
d -0.749077 -0.586023  1.805931  1.159662
e -1.662098  2.302941 -0.553762  0.200082

##SUMMARY STATISTICS

In [23]:
my_df.transpose().describe()

              a         b         c         d         e
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.030700  0.368859  0.301713  0.417189  0.040230
std    0.376893  1.492600  1.581003  1.100902  1.450181
min   -0.607435 -2.182182 -2.162436 -0.749077 -1.662098
25%    0.005194  0.500794  0.115989 -0.586023 -0.553762
50%    0.188135  0.786749  0.284912  0.455451 -0.086013
75%    0.222896  1.046098  1.225235  1.159662  0.200082
max    0.344710  1.692836  2.044867  1.805931  2.302941

In [24]:
my_df.sum()

c1   -3.563966
c2   -0.375312
c3    2.678411
c4    3.528696
c5    3.525627
dtype: float64

In [25]:
my_df.transpose().sum()

a    0.153500
b    1.844295
c    1.508567
d    2.085944
e    0.201150
dtype: float64

In [26]:
my_df.cumsum()

         c1        c2        c3        c4        c5
a  0.222896 -0.607435  0.344710  0.005194  0.188135
b  1.009645 -2.789616  0.845504  1.051292  1.880971
c -1.152791 -0.744750  0.961493  2.276527  2.165883
d -1.901868 -0.289299  0.375470  4.082458  3.325545
e -3.563966 -0.375312  2.678411  3.528696  3.525627

In [27]:
my_df.cumsum(axis=1)

         c1        c2        c3        c4        c5
a  0.222896 -0.384539 -0.039829 -0.034635  0.153500
b  0.786749 -1.395432 -0.894638  0.151459  1.844295
c -2.162436 -0.117569 -0.001580  1.223655  1.508567
d -0.749077 -0.293626 -0.879649  0.926282  2.085944
e -1.662098 -1.748111  0.554830  0.001068  0.201150

In [28]:
#Index of minimum value
my_df.idxmin()

c1    c
c2    b
c3    d
c4    e
c5    a
dtype: object

In [29]:
#Index of minimum value
my_df.idxmin(axis=1)

a    c2
b    c2
c    c1
d    c1
e    c1
dtype: object